package com.analysys.kong.util;

public enum CodeEnum {
	C100("100[临时响应——继续请求]"),
	C101("101[临时响应——切换协议]"),
	C102("102[临时响应——继续执行]"),
	
	C200("200[成功——请求成功]"),
	C201("201[成功——已经创建]"),
	C202("202[成功——已经接受]"),
	C203("203[成功——非授权信息]"),
	C204("204[成功——无内容返回]"),
	C205("205[成功——重置内容]"),
	C206("206[成功——部分内容返回]"),
	C207("207[成功——多种状态]"),
	C208("208[成功——已经报告]"),
	
	C300("300[重定向——多种选择]"),
	C301("301[重定向——永久移动]"),
	C302("302[重定向——临时移动]"),
	C303("303[重定向——查看其他位置]"),
	C304("304[重定向——未修改]"),
	C305("305[重定向——使用代理]"),
	C307("307[重定向——临时重定向]"),
	
	C400("400[请求错误——错误请求]"),
	C401("401[请求错误——未授权]"),
	C403("403[请求错误——禁止请求]"),
	C404("404[请求错误——未找到]"),
	C405("405[请求错误——方法禁用]"),
	C406("406[请求错误——不接受]"),
	C407("407[请求错误——需要代理授权]"),
	C408("408[请求错误——请求超时]"),
	C409("409[请求错误——请求冲突]"),
	C410("410[请求错误——已删除]"),
	C411("411[请求错误——需要有效长度]"),
	C412("412[请求错误——未满足前提条件]"),
	C413("413[请求错误——请求实体过大]"),
	C414("414[请求错误——请求的URI过长]"),
	C415("415[请求错误——不支持的媒体类型]"),
	C416("416[请求错误——请求范围不符合要求]"),
	C417("417[请求错误——未满足期望值]"),
	C419("419[请求错误——认证超时]"),
	C420("420[请求错误——方法失效]"),
	C421("421[请求错误——连接过多]"),
	C422("422[请求错误——错误实体]"),
	C423("423[请求错误——资源被锁定]"),
	C424("424[请求错误——错误接洽关系]"),
	C425("425[请求错误——无序集合]"),
	C426("426[请求错误——进级请求]"),
	C428("428[请求错误——要求先决条件]"),
	C429("429[请求错误——太多请求]"),
	C431("431[请求错误——请求头字段太大]"),
	C451("451[请求错误——因法律原因而被官方审查]"),
	C494("494[请求错误——请求头太大(Nginx)]"),
	C495("495[请求错误——证书错误(Nginx)]"),
	C496("496[请求错误——没有证书(Nginx)]"),
	C497("497[请求错误——HTTP到HTTPS(Nginx)]"),
	C498("498[请求错误——令牌超时或失效(Nginx)]"),
	C499("499[请求错误——客户端关闭请求(Nginx)]"),
	
	C500("500[服务器错误——服务器内部错误]"),
	C501("501[服务器错误——尚未实施]"),
	C502("502[服务器错误——错误网关]"),
	C503("503[服务器错误——服务不可用]"),
	C504("504[服务器错误——网关超时]"),
	C505("505[服务器错误——HTTP版本不受支持]"),
	C506("506[服务器错误——变体协商]"),
	C507("507[服务器错误——存储不足]"),
	C509("509[服务器错误——超过带宽限制]"),
	C510("510[服务器错误——不可拓展]"),
	C511("511[服务器错误——要求网络认证]"),
	
	C600("600[自定义——未查询到结果]"),
	C1009("1009[自定义——未查询到结果]");
	
	public String desc;

	private CodeEnum(String desc) {
		this.desc = desc;
	}
}
